# Fc Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Fc Property
SymbolTypeId Class See Also
---
Symbol fc, indicating unit Footcandles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Fc { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Fc As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Fc {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace